monitoreos/bajapaquetesDTH/logs/log_20250729_091330.txt

[2025-07-29 09:13:30.313] Inicio del envío
Endpoint: http://172.20.11.105:8080/CAI3G1.2/services/CAI3G1.2/async
Usuario: EmaCmdSV
Delay: 5000 ms

[2025-07-29 09:13:30.314] [0] XML generado:
<?xml version="1.0" encoding="ISO-8859-1" standalone="yes"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" 
                  xmlns:dth="http://schemas.ericsson.com/ma/CA/DTHBatch/">
  <soapenv:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>EmaCmdSV</wsse:Username>
        <wsse:Password>EmaCmdSV@1</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <cai3:Set>
      <cai3:MOType>DTH@http://schemas.ericsson.com/ma/CA/DTHBatch/</cai3:MOType>
      <cai3:MOId>
        <dth:OrderID>1234567899999</dth:OrderID>
      </cai3:MOId>
      <cai3:MOAttributes>
        <dth:SetDTH OrderID="1234567899999">
          <dth:useCase>Disable_Package</dth:useCase>
          <dth:Devices>
            <dth:Device>
              <dth:STU_number>123456789999</dth:STU_number>
              <dth:SC_uniqueAddress>1234567899999</dth:SC_uniqueAddress>
              <dth:packageId>212221321</dth:packageId>
            </dth:Device>
          </dth:Devices>
        </dth:SetDTH>
      </cai3:MOAttributes>
    </cai3:Set>
  </soapenv:Body>
</soapenv:Envelope>

[2025-07-29 09:13:30.575] [0] Envío exitoso - Duración: 0.26s

----------------------------------------

[2025-07-29 09:13:35.574] [1] XML generado:
<?xml version="1.0" encoding="ISO-8859-1" standalone="yes"?>
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" 
                  xmlns:cai3="http://schemas.ericsson.com/cai3g1.2/" 
                  xmlns:dth="http://schemas.ericsson.com/ma/CA/DTHBatch/">
  <soapenv:Header>
    <wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd">
      <wsse:UsernameToken>
        <wsse:Username>EmaCmdSV</wsse:Username>
        <wsse:Password>EmaCmdSV@1</wsse:Password>
      </wsse:UsernameToken>
    </wsse:Security>
  </soapenv:Header>
  <soapenv:Body>
    <cai3:Set>
      <cai3:MOType>DTH@http://schemas.ericsson.com/ma/CA/DTHBatch/</cai3:MOType>
      <cai3:MOId>
        <dth:OrderID>1234567899999</dth:OrderID>
      </cai3:MOId>
      <cai3:MOAttributes>
        <dth:SetDTH OrderID="1234567899999">
          <dth:useCase>Disable_Package</dth:useCase>
          <dth:Devices>
            <dth:Device>
              <dth:STU_number>123456789999</dth:STU_number>
              <dth:SC_uniqueAddress>1234567899999</dth:SC_uniqueAddress>
              <dth:packageId>212221321</dth:packageId>
            </dth:Device>
          </dth:Devices>
        </dth:SetDTH>
      </cai3:MOAttributes>
    </cai3:Set>
  </soapenv:Body>
</soapenv:Envelope>

[2025-07-29 09:13:35.637] [1] Envío exitoso - Duración: 0.06s

----------------------------------------

[2025-07-29 09:13:40.638] Resumen del proceso:
Total registros: 2
Enviados exitosos: 2
Registros omitidos: 0
Errores detectados: 0
[2025-07-29 09:13:40.638] Proceso finalizado
